

"""
Користувач має пошту у домені @kpi.ua. Він купляє товари вказуючи назву та ціну.

Формати даних:

    пошта: перша літера англійської абетки у нижньому регістрі, далі стоїть крапка потім прізвище студента.

    назва товару : не більше 10 літер англійської абетки у нижньому регістрі

    ціна товару: додатне дійсне число з двома знаками після десяткової коми

"""


#    Сформувати структуру датасету для дного користувача.


dataset = \
{
    "(063)-213-2344":
        {
        # "client_name": 'Jon',
        "hotels" : {
                    'hotel1': {"price":[100,102,130,102,130]},
                    'hotel2':
                            {"price":[150,152,170]},
                    'hotel3':
                            {"price":[1200,1032,1230,900]},
                    'hotel4':
                            {"price":[1030,1032,1330,1900]}
        }

        }

}







